app/controllers/choices_controller.rb

  def index
    @choices = Choice.all
---
SELECT * FROM `choices`

  def destroy
    @choice = Choice.find(params[:id])
    @choice.destroy
---
SELECT * FROM `choices` WHERE (`choices`.`id` = 1)
DELETE FROM `choices` WHERE `id` = 1