app/controllers/login_controller.rb

SELECT * FROM `users` WHERE (username='deecee' and password = 'diego')
---
  def authenticate
    value = params[:username]
    reset_session
    login= User.find(:all, :conditions=>"username='"+params[:username]+"' and password = '" + params[:password]+"'")