app/controllers/questions_controller.rb

SELECT * FROM `questions` WHERE (subject_id='${session[:subjectid]}')
SELECT * FROM `sections` WHERE (id = 6)
SELECT * FROM `subjects` WHERE (id = 1)
---
  def index
    if(params[:quiz]==nil)
      @questions = Question.all
    else
      session[:quizid]=params[:quiz]
      @questions = Question.find_by_sql("select * from questions
where question!= all
(SELECT question from questions
join publishquizzes
on questions.id = question_id
join quizzes
on quizzes.id = quiz_id
where quiz_id =
"+session[:quizid]+")")
      @quizzes = Quiz.find(:all, :conditions=>"section_id = "+session[:sectionid]+" and status='Unpublished'")
      #@sections = Section.find(:all,:conditions=>"id = "+@quizzes[0].section_id.to_s)
      @sections = Section.find(:all,:conditions=>"id = "+session[:sectionid])
      @subject = Subject.find(:all,:conditions=>"id = "+@sections[0].subject_id.to_s)

SELECT * FROM `questions` WHERE (`questions`.`id` = 1)
---
  def show
    @question = Question.find(params[:id])

SELECT * FROM `questions` WHERE (`questions`.`id` = 21)
---
  def edit
    @question = Question.find(params[:id])

INSERT INTO `questions` (`answer`, `updated_at`, `question`, `subject_id`, `difficulty`, `created_at`) VALUES('this', '2010-08-29 20:57:42', 'question', 1, 'Hard', '2010-08-29 20:57:42')
SELECT * FROM `choices`
INSERT INTO `choices` (`updated_at`, `question_id`, `value`, `created_at`) VALUES('2010-08-29 21:19:41', NULL, 'hey you', '2010-08-29 21:19:41')
---
  def create
    @question = Question.new(params[:question])
    @question.subject_id=session[:subjectid]

    respond_to do |format|
      if @question.save
        format.html { redirect_to(@question, :notice => 'Question was successfully created.') }
        format.xml  { render :xml => @question, :status => :created, :location => @question }
      else
        format.html { render :action => "new" }
        format.xml  { render :xml => @question.errors, :status => :unprocessable_entity }
      end

  end

    if (params[:A]!=nil)
    @choices = Choice.new()
    @choices.value = params[:A]
    @choices.question_id=@question.id
    @choices.save

SELECT * FROM `questions` WHERE (`questions`.`id` = 21)
UPDATE `questions` SET `difficulty` = 'Moderate', `updated_at` = '2010-08-29 21:47:32' WHERE `id` = 21
---
  def update
    @question = Question.find(params[:id])

    respond_to do |format|
      if @question.update_attributes(params[:question])