app/controllers/quizzes_controller.rb

SELECT * FROM `sections` WHERE (id = 6)
SELECT * FROM `subjects` WHERE (id = 1)
---
  def index

    if(params[:section]==nil)
       @quizzes = Quiz.all
   else
      session[:sectionid]=params[:section]
      @quizzes = Quiz.find(:all, :conditions=>"section_id = "+params[:section]+" and status='Open'")
      #@sections = Section.find(:all,:conditions=>"id = "+@quizzes[0].section_id.to_s)
      @sections = Section.find(:all,:conditions=>"id = "+params[:section])
      @subject = Subject.find(:all,:conditions=>"id = "+@sections[0].subject_id.to_s)