app/controllers/sections_controller.rb

SELECT * FROM `sections` WHERE (subject_id='${params[:subject]}' and user_id='${session[:userid]}')
SELECT * FROM `subjects` WHERE (id = 1)
---
  def index
   if(params[:subject]==nil)
      @sections = Section.all
      @sections = Section.find_by_sql("SELECT * FROM `sections`
join subjects
on subjects.id = subject_id
where user_id =
" + session[:userid])
   else
      session[:subjectid]=params[:subject]


      @sections = Section.find(:all, :conditions=>"subject_id = "+params[:subject]+" and user_id = "+session[:userid])
      @subject = Subject.find(:all,:conditions=>"id = "+params[:subject])

SELECT * FROM `sections` WHERE (`sections`.`id` = 2)
---
  def show
    @section = Section.find(params[:id])

SELECT * FROM `sections` WHERE (`sections`.`id` = 1)
---
  def edit
    @section = Section.find(params[:id])

INSERT INTO `sections` (`updated_at`, `time`, `day`, `subject_id`, `user_id`, `section`, `created_at`) VALUES('2010-08-29 03:15:48', '1:00-2:30', 'TH', 1, 1, 'S13', '2010-08-29 03:15:48')
---
  def create
    @section = Section.new(params[:section])

    @section.user_id=session[:userid]
    @section.subject_id=session[:subjectid]
    respond_to do |format|
      if @section.save

SELECT * FROM `sections` WHERE (`sections`.`id` = 1)
DELETE FROM `sections` WHERE `id` = 1
---
  def destroy
    @section = Section.find(params[:id])
    @section.destroy