app/controllers/subjects_controller.rb

  def index
    @subjects = Subject.all
---
SELECT * FROM `subjects`

  def show
    @subject = Subject.find(params[:id])
---
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 2)

  def edit
    @subject = Subject.find(params[:id])
---
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 9)

  def create
    @subject = Subject.new(params[:subject])

    respond_to do |format|
      if @subject.save
---
INSERT INTO `subjects` (`name`, `updated_at`, `description`, `created_at`) VALUES('we', '2010-08-28 22:46:02', 'we', '2010-08-28 22:46:02')

  def update
    @subject = Subject.find(params[:id])

    respond_to do |format|
      if @subject.update_attributes(params[:subject])
---
SELECT * FROM `subjects` WHERE (`subjects`.`id` = 1)
UPDATE `subjects` SET `description` = 'Ruby on Rails Introduction', `updated_at` = '2010-08-29 04:34:24', `name` = 'RUBYDEV' WHERE `id` = 1