app/controllers/users_controller.rb

INSERT INTO `users` (`category`, `updated_at`, `username`, `lname`, `fname`, `password`, `created_at`) VALUES('Student', '2010-08-29 03:14:43', 'deecee', 'diego', 'deecee', 'diego', '2010-08-29 03:14:43')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 2)
UPDATE `users` SET `category` = 'Teacher', `updated_at` = '2010-08-29 15:36:15' WHERE `id` = 2
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])